In [106]:
import pandas as pd

df = pd.read_excel('dadosAusentes.xlsx')
print(df)

     Nome  Idade          Cidade  Salário
0    João   28.0       São Paulo   2500.0
1   Maria    NaN  Rio de Janeiro   4500.0
2    José   35.0             NaN      NaN
3     Ana   22.0       Salavador   5000.0
4   Pedro    NaN    Porto Alegre   4800.0
5     Ana   22.0       Salavador   5000.0
6  tobias   22.0       são paulo   5000.0
7  carlos   22.0    porto alegre   5000.0

In [107]:
#corrigir errros de formatação (maiusculo, minusculo)
df['Cidade'] = df['Cidade'].str.title()
df['nome'] = df['Nome'].str.capitalize()

print(df)

     Nome  Idade          Cidade  Salário    nome
0    João   28.0       São Paulo   2500.0    João
1   Maria    NaN  Rio De Janeiro   4500.0   Maria
2    José   35.0             NaN      NaN    José
3     Ana   22.0       Salavador   5000.0     Ana
4   Pedro    NaN    Porto Alegre   4800.0   Pedro
5     Ana   22.0       Salavador   5000.0     Ana
6  tobias   22.0       São Paulo   5000.0  Tobias
7  carlos   22.0    Porto Alegre   5000.0  Carlos

In [108]:
#Substituir de valores categóricos: sao paulo, sp, rj
df['Cidade'].str.lower().replace({'são paulo': "SP", 'rio de janeiro': 'RJ', 'rj': 'RJ'})
print(df)

     Nome  Idade          Cidade  Salário    nome
0    João   28.0       São Paulo   2500.0    João
1   Maria    NaN  Rio De Janeiro   4500.0   Maria
2    José   35.0             NaN      NaN    José
3     Ana   22.0       Salavador   5000.0     Ana
4   Pedro    NaN    Porto Alegre   4800.0   Pedro
5     Ana   22.0       Salavador   5000.0     Ana
6  tobias   22.0       São Paulo   5000.0  Tobias
7  carlos   22.0    Porto Alegre   5000.0  Carlos

In [109]:
#Identificar os tipos de dados das colunas
coluna_string = df.select_dtypes(include=['string', 'object']).columns.tolist()
print(coluna_string)

['Nome', 'Cidade', 'nome']

In [110]:
#Identificar os tipos de dados das colunas de float
coluna_float = df.select_dtypes(include=['float']).columns.tolist()
print(coluna_float)

['Idade', 'Salário']

In [111]:
#Substituir as idades ausentes plea média
df['Idade'].fillna(df['Idade'].mean(), inplace=True)
print(df)

     Nome      Idade          Cidade  Salário    nome
0    João  28.000000       São Paulo   2500.0    João
1   Maria  25.166667  Rio De Janeiro   4500.0   Maria
2    José  35.000000             NaN      NaN    José
3     Ana  22.000000       Salavador   5000.0     Ana
4   Pedro  25.166667    Porto Alegre   4800.0   Pedro
5     Ana  22.000000       Salavador   5000.0     Ana
6  tobias  22.000000       São Paulo   5000.0  Tobias
7  carlos  22.000000    Porto Alegre   5000.0  Carlos

C:\Users\48434487888\AppData\Local\Temp\ipykernel_14152\2891120879.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Idade'].fillna(df['Idade'].mean(), inplace=True)

In [112]:
#Converter os dados para int
df['Idade'] = df['Idade'].astype(int)
print(df)

     Nome  Idade          Cidade  Salário    nome
0    João     28       São Paulo   2500.0    João
1   Maria     25  Rio De Janeiro   4500.0   Maria
2    José     35             NaN      NaN    José
3     Ana     22       Salavador   5000.0     Ana
4   Pedro     25    Porto Alegre   4800.0   Pedro
5     Ana     22       Salavador   5000.0     Ana
6  tobias     22       São Paulo   5000.0  Tobias
7  carlos     22    Porto Alegre   5000.0  Carlos

In [113]:
# #Pega o valor de cima
# df['Idade'] = df['Idade'].ffill

# #Pega o valor de baixo
# df['Idade'] = df['Idade'].bfill
# display(df)

In [115]:
# #Criar uma nova coluna: Faixa Etária
df['Faixa Etária'] = pd.cut(df['Idade'], bins=[0, 18, 30, 50, 100], labels=['Jovem', 'Adulto', 'Meia-idade', 'Idoso'])
print(df)

     Nome  Idade          Cidade  Salário    nome Faixa Etária
0    João     28       São Paulo   2500.0    João       Adulto
1   Maria     25  Rio De Janeiro   4500.0   Maria       Adulto
2    José     35             NaN      NaN    José   Meia-idade
3     Ana     22       Salavador   5000.0     Ana       Adulto
4   Pedro     25    Porto Alegre   4800.0   Pedro       Adulto
5     Ana     22       Salavador   5000.0     Ana       Adulto
6  tobias     22       São Paulo   5000.0  Tobias       Adulto
7  carlos     22    Porto Alegre   5000.0  Carlos       Adulto

In [117]:
#Remover duplicatas
df = df.drop_duplicates(subset=['Nome'])
display(df)

     Nome  Idade          Cidade  Salário    nome Faixa Etária
0    João     28       São Paulo   2500.0    João       Adulto
1   Maria     25  Rio De Janeiro   4500.0   Maria       Adulto
2    José     35             NaN      NaN    José   Meia-idade
3     Ana     22       Salavador   5000.0     Ana       Adulto
4   Pedro     25    Porto Alegre   4800.0   Pedro       Adulto
6  tobias     22       São Paulo   5000.0  Tobias       Adulto
7  carlos     22    Porto Alegre   5000.0  Carlos       Adulto